ERM/src/Documents/Memo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Memo</Name>
			<Comment>Корректирова долга</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Agreement</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubGeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/КлючиMemo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КлючиMemo</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ArInvoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Documents/Memo/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Номер, Client"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Номер <> Номер
			ИЛИ СтарыеЗначенияКлючей.Client <> Client Тогда
			
			НЗ = РегистрыСведений.КлючиMemo.СоздатьНаборЗаписей();
			НЗ.Отбор.ArInvoice.Установить(СтарыеЗначенияКлючей.Номер);
			НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.ArInvoice.Установить(Номер);
			НЗ.Отбор.Client.Установить(Client);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.ArInvoice = Номер;
			ЗаписьНабора.Client = Client;
			ЗаписьНабора.Memo = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиMemo.СоздатьНаборЗаписей();
		НЗ.Отбор.ArInvoice.Установить(Номер);
		НЗ.Отбор.Client.Установить(Client);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.ArInvoice = Номер;
		ЗаписьНабора.Client = Client;
		ЗаписьНабора.Memo = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиMemo.СоздатьНаборЗаписей();
	НЗ.Отбор.ArInvoice.Установить(Номер);
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Записать(Истина);
	
КонецПроцедуры
